import React from "react";
import styles from './CurrentSquad.module.css';

export function CurrentSquad() {
    const getRandomStyle = () => ({
        color: `#${Math.floor(Math.random()*16777215).toString(16)}`,
        fontSize: `${Math.floor(Math.random() * 10) + 15}px`,
      });
    return (
    <div style={getRandomStyle()} className={styles.body}>
        <div>
            <b>Coach:</b> <span>Роман Григорчук</span>
        </div>
        <div>
            <b>Captain: </b> <span>Денис Кожанов</span>
        </div>
        <div>
            <b>Bench:</b>
            <ul>
                <li><b>Олександр Гай</b> <span>Захисник</span></li>
                <li><b>Віктор Сахневич</b> <span>Півзахисник</span></li>
            </ul>
        </div>
        <table>
            <tr>
                <th colSpan={2}>Players</th>
            </tr>
            <tr>
                <th rowSpan={2}>Голкіпери</th>
                <td>Артур Рудко (32 роки, Україна)</td>
            </tr>
            <tr>
                <td>Ян Вічний (27 років, Україна)</td>
            </tr>
            <tr>
                <th rowSpan={8}>Захисники</th>
            </tr>
            <tr>
                <td>Роман Савченко (20 років, центральний захисник, Україна)</td>
            </tr>
            <tr>
                <td>Віталій Єрмаков (32 роки, центральний захисник, Україна)</td>
            </tr>
            <tr>
                <td>Володимир Арсіć (23 роки, центральний захисник, Боснія і Герцеговина)</td>
            </tr>
            <tr>
                <td>Данило Удод (20 років, центральний захисник, Україна)</td>
            </tr>
            <tr>
                <td>Борис Лотоцький (21 рік, центральний захисник, Україна)</td>
            </tr>
            <tr>
                <td>Богдан Бутко (33 роки, правий захисник, Україна)</td>
            </tr>
            <tr>
                <td>Ярослав Кисіль (21 рік, правий захисник, Україна)</td>
            </tr>
            <tr>
                <th rowSpan={6}>Півзахисники</th>
            </tr>
            <tr>
                <td>Олександр Васильєв (30 років, опорний півзахисник, Україна)</td>
            </tr>
            <tr>
                <td>Богдан Білошевський (24 роки, опорний півзахисник, Україна)</td>
            </tr>
            <tr>
                <td>Джон Спорн (27 років, центральний півзахисник, Словенія)</td>
            </tr>
            <tr>
                <td>Артем Габелок (29 років, центральний півзахисник, Україна)</td>
            </tr>
            <tr>
                <td>Артем Присяжнюк (19 років, центральний півзахисник, Україна)</td>
            </tr>
            <tr>
                <th rowSpan={4}>Нападники</th>
            </tr>
            <tr>
                <td>Денис Янаков (25 років, лівий вінгер, Україна)</td>
            </tr>
            <tr>
                <td>Олексій Хобленко (30 років, центрфорвард, Україна)</td>
            </tr>
            <tr>
                <td>Кирил Попов (21 рік, центрфорвард, Україна)</td>
            </tr>
        </table>
    </div>);
}